---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangularBar
source: html/90099c76-829c-f5fb-fd07-0ae9bed72053.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangularBar

Defines parameters for Rectangular Bar structural section.

## Syntax (C#)
```csharp
public class StructuralSectionRectangularBar : StructuralSectionGeneralF
```